{
  "cursos": [
    {
      "titulo": "Fundamentos da Programação",
      "curso-nome":"fp",
      "personagem-nome": "Lara",
      "personagem-img": "../../view/img/lara.png",
      "descricao": "Aprenda os conceitos essenciais da programação de forma leve e prática! Nesta fase, você descobre o que é um algoritmo, entende por que computadores precisam de instruções precisas e explora lógica básica com desafios interativos: do famoso “sanduíche lógico” aos primeiros passos em loops, condicionais e funções.",
      "instrucoes": "blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah",
      "frase":"Ensinar um computador é como ensinar um alien: cada passo conta!",
      "cor-borda":"#4C1753",
      "cor-fundo":"#825886",
      "cor-questao":"#B27BB8",
      "links":[
        {
          "nome":"Curso de Lógica de Programação - Curso em Vídeo",
          "url":"https://www.cursoemvideo.com/course/curso-de-logica-de-programacao/"
        },
        {
          "nome":"Algoritmos: Lógica para Desenvolvimento de Programação de Computadores - Coursera",
          "url":"https://www.coursera.org/learn/algoritmos-logica-programacao"
        },
        {
          "nome":"Lógica de Programação para Iniciantes - Udemy",
          "url":"https://www.udemy.com/course/logica-de-programacao-para-iniciantes/"
        }
      ]
    },
    {
      "titulo": "Inteligência Artificial",
      "curso-nome":"ia",
      "personagem-nome": "Ayla",
      "personagem-img": "../../view/img/ayla.png",
      "descricao": "Este jogo é uma simulação de um Agente Aspirador Reativo Simples, um dos modelos fundamentais da Inteligência Artificial. O objetivo do jogo é demonstrar como o robô pode cumprir uma tarefa (limpar um ambiente) baseando-se apenas em um conjunto de regras SE/ENTÃO e na sua percepção imediata. O Ambiente de simulação consiste em uma grade linear de 9 células, onde cada posição está em um estado de sujo ou limpo. O agente, representado pelo robô, opera em um ciclo contínuo de Percepção → Decisão → Ação. O objetivo do robô é limpar todas as 12 células no ambiente e, em seguida, parar suas operações, utilizando apenas as três Percepções disponíveis (celula_atual_suja, celula_atual_limpa, todas_limpas) e as três Ações disponíveis (limpar, mover_aleatorio, parar).",
      "instrucoes": "Seu desafio é criar a tabela de regras (combinando uma Percepção com uma Ação) de forma que o agente seja considerado racional, sempre fazendo a escolha que maximiza seu objetivo, lembrando que a ordem das regras é crucial para o sucesso do robô. Bom jogo!",
      "frase":"A mente humana inspira. A máquina aprende.",
      "cor-borda":"#143A64",
      "cor-fundo":"#4B6D97",
      "cor-questao":"#597DA8"
    },
    {
      "titulo": "Segurança Cibernética",
      "curso-nome":"sc",
      "personagem-nome": "Nia",
      "personagem-img": "../../view/img/nia.png",
      "descricao": "Aprenda a proteger dados, sistemas e redes enquanto enfrenta ameaças reais do mundo digital. Nesta fase, você entende os principais tipos de ataques, explora boas práticas de segurança e toma decisões para defender uma empresa virtual de hackers: desde criar senhas fortes até identificar phishing e configurar firewalls.",
      "instrucoes": "blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah",
      "frase":"Confie em mim — eu protejo o que importa.",
      "cor-borda":"#44651F",
      "cor-fundo":"#638B37",
      "cor-questao":"#7CA64E"
    },
    {
      "titulo": "Ciência de Dados",
      "curso-nome":"cd",
      "personagem-nome": "Sofia",
      "personagem-img": "../../view/img/sofia.png",
      "descricao": "Combina matemática e estatística, programação, análise e visualização de dados, inteligência artificial e aprendizado de máquina, junto com o conhecimento do domínio específico do negócio. O objetivo é extrair insights úteis e acionáveis a partir de grandes volumes de dados, apoiando a tomada de decisão e o planejamento estratégico de uma organização. Um cientista de dados deve compreender o contexto da empresa para formular perguntas relevantes, identificar problemas, coletar e preparar dados, desenvolver modelos e algoritmos, automatizar processos analíticos e comunicar resultados, mostrando como podem resolver desafios reais.",
      "instrucoes": "De acordo com o quanto deseja gastar, seu objetivo é montar uma viagem sem ultrapassar o orçamento.",
      "frase":"Os dados falam. Eu só traduzo.",
      "cor-borda":"#C54B14",
      "cor-fundo":"#F4A222",
      "cor-questao":"#FCB33F",
      "links":[
        {
          "nome":"Objetivo Ciência de Dados",
          "url":"https://www.insper.edu.br/pt/conteudos/tecnologia/profissao-cientista-de-dadoss"
        },
        {
          "nome":" O que faz um cientista de dados?",
          "url":"https://aws.amazon.com/pt/what-is/data-science/   "
        }
      ]
    },
    {
      "titulo": "Hardware",
      "curso-nome":"hd",
      "personagem-nome": "Kaori",
      "personagem-img": "../../view/img/kaori.png",
      "descricao": "Qualquer componente físico que constitui um dispositivo eletrônico. É a parte física que habilita o funcionamento de um dispositivo eletrônico, executam tarefas de processamento, transmissão ou armazenamento de dados, a partir de sistemas mecânicos ou de comandos enviados pelos softwares. Um hardware funciona sem um software desde que o sistema seja controlado por mecanismos físicos, hidráulicos ou elétricos. Geladeiras e micro-ondas mais antigos, por exemplo, funcionavam sem a necessidade de softwares.",
      "instrucoes": "Para jogar basta clicar e arrastar cada imagem em sua respectiva função dentro de um computador.",
      "frase":"Se não funciona, a gente monta de novo — melhor ainda!",
      "cor-borda":"#313336",
      "cor-fundo":"#5D6164",
      "cor-questao":"#666869",
      "links":[
        {
          "nome":" O que faz um profissional que trabalha com hardware?",
          "url":"https://www.elaborata.com.br/blog/2018/06/11/o-que-faz-um-tecnico-em-hardware/"
        },
        {
          "nome":"O que é Hardware?",
          "url":"https://tecnoblog.net/responde/o-que-e-hardware/  "
        }
      ]
    },
    {
      "titulo": "Web Development",
      "curso-nome":"wd",
      "personagem-nome": "Maya",
      "personagem-img": "../../view/img/maya.png",
      "descricao": "Bem-vindo ao desafio interativo onde você deve corrigir problemas reais de HTML, CSS e JavaScript que estão quebrando a página! A cada nível, você receberá uma situação prática — como um título faltando, um estilo errado ou um botão sem função — e deverá escolher a linha de código correta para arrumar o erro. Seu objetivo é restaurar a página até que todos os elementos funcionem como deveriam.",
      "instrucoes": "Para jogar, basta seguir as instruções de cada nível e realizar exatamente o que for pedido. Não há limite de tempo, mas cada ação deve ser feita corretamente para permitir o avanço. À medida que o jogo progride, as tarefas podem mudar de formato e exigir diferentes tipos de interação. Caso algo não funcione, tente observar a tela com cuidado — muitas tarefas exigem apenas um pequeno detalhe para serem finalizadas. Boa sorte e divirta-se completando cada desafio!",
      "frase":"Se dá pra imaginar, dá pra publicar!",
      "cor-borda":"#DD6700",
      "cor-fundo":"#FC963D",
      "cor-questao":"#F59949"
    }
    ]
}